PORT-015: Using Mermaid for diagrams
Signed-off-by: Ulises Tirado Zatarain <ulises.tirado@cimat.mx>
